#!/bin/bash
#set -eux
#==================================================================================================
#
# リポジトリ更新反映処理
#   リモートリポジトリ が設定されている場合、git commit & push
#   定義されていない場合、git commit だけを実行します。
#
# 引数
#   1: コミットコメント
#   2: コミットユーザ   ※任意
#
#==================================================================================================
#--------------------------------------------------------------------------------------------------
# 環境設定
#--------------------------------------------------------------------------------------------------
# カレントディレクトリの移動
dir_script="$(dirname $0)"
cd "$(cd ${dir_script}; pwd)" || exit 1

# 共通設定
readonly DIR_BASE=$(cd ../..; pwd)
. ../setenv


#--------------------------------------------------------------------------------
# ユーティリティ読み込み
#--------------------------------------------------------------------------------
# ログ出力ユーティリティ
. "${DIR_BIN_LIB}/logging_utils.sh"
# gitユーティリティ
. "${DIR_BIN_LIB}/git_utils.sh"
# git操作バウンダリ共通処理
. "${DIR_BIN}/git/_common.sh"



#--------------------------------------------------------------------------------------------------
# 関数定義
#--------------------------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# Usage
#--------------------------------------------------------------------------------
function usage() {
  echo "Usage: $(basename $0) COMMENT [USER]" >&2
  exit ${EXITCODE_ERROR}
}



#--------------------------------------------------------------------------------------------------
# 事前処理
#--------------------------------------------------------------------------------------------------
raw_args="$*"
ret_code=${EXITCODE_SUCCESS}


#--------------------------------------------------------------------------------
# オプション解析
#--------------------------------------------------------------------------------
while :; do
  case $1 in
    -h|--help)
      usage
      ;;
    --)
      shift
      break
      ;;
    -*)
      usage
      ;;
    *)
      break
      ;;
  esac
done


#--------------------------------------------------------------------------------
# 開始ログ
#--------------------------------------------------------------------------------
log.save_indent
log.info_teelog "START --- $(basename $0) ${raw_args}"
log.add_indent


#--------------------------------------------------------------------------------
# 引数取得
#--------------------------------------------------------------------------------
# 引数チェック
if [ $# -lt 1 ] || [ $# -gt 2 ]; then
  usage
fi

# コミットコメント
comment="$1"
if [ "${comment}x" = "x" ]; then
  git.common.exit_script ${EXITCODE_ERROR} "コミットコメント が指定されていません。"
fi

# コミットユーザ
user="$2"



#--------------------------------------------------------------------------------------------------
# 本処理
#--------------------------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# Git作業ディレクトリ取得
#--------------------------------------------------------------------------------
dir_repo="$(git.common.get_repo_dir ${user})"
if [ $? -ne ${EXITCODE_SUCCESS} ]; then
  return ${EXITCODE_ERROR}
fi


#--------------------------------------------------------------------------------
# commit | push
#--------------------------------------------------------------------------------
has_origin=$(git.has_origin "${dir_repo}")
if [ $? -ne ${EXITCODE_SUCCESS} ]; then
  git.common.exit_script ${EXITCODE_ERROR} "リモートリポジトリの存在確認 でエラーが発生しました。"
fi

if [ "${has_origin}" != "true" ]; then
  # 存在しない場合、commit
  git.staging_and_commit "${dir_repo}" "${comment}"                                           2>&1 | tee -a "${PATH_LOG}"
else
  # 存在する場合、push
  git.staging_and_push "${dir_repo}" "${comment}"                                             2>&1 | tee -a "${PATH_LOG}"
fi
ret_code=${PIPESTATUS[0]}

if [ ${ret_code} -eq ${EXITCODE_WARN} ]; then
  git.common.exit_script ${EXITCODE_WARN} "ステージング対象が存在しません。"

elif [ ${ret_code} -eq ${EXITCODE_ERROR} ]; then
  git.common.exit_script ${EXITCODE_ERROR} "エラーが発生しました。"
fi



#--------------------------------------------------------------------------------------------------
# 事後処理
#--------------------------------------------------------------------------------------------------
git.common.exit_script ${EXITCODE_SUCCESS} "${EXITMSG_SUCCESS}"
