#!/bin/bash
#set -eux
#==================================================================================================
#
# 接続情報の暗号化
#
#==================================================================================================
#--------------------------------------------------------------------------------------------------
# 環境設定
#--------------------------------------------------------------------------------------------------
# カレントディレクトリの移動
dir_script="$(dirname $0)"
cd "$(cd ${dir_script}; pwd)" || exit 1

# 共通設定
readonly DIR_BASE=$(cd ../..; pwd)
. ../setenv

# ログ出力ユーティリティ
. "${DIR_BIN_LIB}/logging_utils.sh"



#--------------------------------------------------------------------------------------------------
# 関数定義
#--------------------------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# Usage
#--------------------------------------------------------------------------------
function usage() {
  echo "Usage: $(basename $0)" >&2
  exit ${EXITCODE_ERROR}
}

#--------------------------------------------------------------------------------
# exit script
#
# 引数
#  ・1: EXIT CODE
#  ・2: メッセージ
#--------------------------------------------------------------------------------
function exit_script() {
  local _exit_code=$1
  local _exit_msg=$2

  # 終了ログ
  log.restore_indent
  if [ ${_exit_code} -eq ${EXITCODE_SUCCESS} ]; then
    log.info_teelog "${_exit_msg}"
    log.info_teelog "exit_code: ${_exit_code}"
    log.info_teelog "END   --- $(basename $0)"
  elif [ ${_exit_code} -eq ${EXITCODE_WARN} ]; then
    log.warn_teelog "${_exit_msg}"
    log.warn_teelog "exit_code: ${_exit_code}"
    log.warn_teelog "END   --- $(basename $0)"
  else
    log.error_teelog "${_exit_msg}"
    log.error_teelog "exit_code: ${_exit_code}"
    log.error_teelog "END   --- $(basename $0)"
  fi

  # ログローテーション（日次） ※先頭行判断
  log.rotatelog_by_day_first

  # 終了
  exit ${_exit_code}
}


#--------------------------------------------------------------------------------------------------
# 事前処理
#--------------------------------------------------------------------------------------------------
log.save_indent
log.info_teelog "START --- $(basename $0) $*"
log.add_indent
ret_code=${EXITCODE_SUCCESS}

#--------------------------------------------------------------------------------
# オプション解析
#--------------------------------------------------------------------------------
while :; do
  case $1 in
    --)
      shift
      break
      ;;
    -*)
      usage
      ;;
    *)
      break
      ;;
  esac
done

#--------------------------------------------------------------------------------
# 引数取得
#--------------------------------------------------------------------------------
# 引数チェック
if [ $# -ne 0 ]; then
  usage
fi

#--------------------------------------------------------------------------------------------------
# 本処理
#--------------------------------------------------------------------------------------------------
log.info_teelog "暗号化キーの生成"
log.add_indent

log.debug_teelog "gen_encrypt_key"
gen_encrypt_key                                                                               2>&1 | log.tee
ret_code=${PIPESTATUS[0]}
if [ ${ret_code} -ne ${EXITCODE_SUCCESS} ]; then
  exit_script ${EXITCODE_SUCCESS} "暗号化キーの生成に失敗しました。"
fi

log.remove_indent


#--------------------------------------------------------------------------------------------------
# 事後処理
#--------------------------------------------------------------------------------------------------
exit_script ${EXITCODE_SUCCESS} "${EXITMSG_SUCCESS}"
